"USSD_ERROR" = "ข้อผิดพลาดจากการทำงานของการขอ";
"USSD_TERMINATED" = "เซ็สชั่นถูกเลิกทำงาน";

"%@ Call Forwarding\n%@\n%@%@" = "โอนสาย%@\n%@\n%@%@";
"%@ Call Waiting\n%@" = "สาย%@เรียกซ้อน\n%@";
"%@ Call Barring\n%@\n%@" = "กันสาย%@\n%@\n%@";
"%@ Fixed Dialing\n%@" = "หมุนเฉพาะสาย%@ที่กำหนด\n%@";
"Connected Line Presentation\n%@" = "การแสดงของสายโทรที่โทรอยู่\n%@";
"Calling Line Presentation\n%@" = "การแสดงของสายโทร\n%@";
"Connected Line ID Restriction\n%@" = "การห้ามแสดงเลข ID ของสายโทรที่โทรอยู่\n%@";
"Calling Line ID Restriction\n%@" = "การห้ามแสดงเลข ID ของสายโทรที่โทรอยู่\n%@";
"SIM Lock\n%@" = "ล็อกซิม\n%@";
"Service Center Address\n%@" = "ที่อยู่ศูนย์บริการ\n%@";
"Supplementary Service Password\n%@" = "รหัสผ่านบริการเสริม\n%@";
"Calling Name Presentation\n%@" = "การแสดงชื่อของสายโทร\n%@";

"Forwards to %@\n" = "โอนไปที่ %@\n";

"All Calls" = "สายทั้งหมด";
"All Conditional Calls" = "สายเงื่อนไขทั้งหมด";
"Async Data Circuit" = "วงจรข้อมูลแบบ Async ";
"Data" = "ข้อมูล";
"Fax" = "แฟกซ์";
"Packet Access" = "เข้าใช้ Packet ";
"Pad Access" = "เข้าใช้ Pad ";
"SMS" = " SMS ";
"Sync Data Circuit" = "วงจรข้อมูลแบบ Sync ";
"Voice" = "เสียง";

"All Outgoing" = "สายออกทั้งหมด";
"All Incoming" = "สายเข้่าทั้งหมด";
"Outgoing International" = "สายออกต่างประเทศ";
"Outgoing International, Except Home Country" = "สายออกต่างประเทศ ยกเว้นประเทศของบ้านที่อาศัยอยู่";
"Incoming While Roaming Outside Home Country" = "สายเข้าขณะร่วมใช้ข้อมูลระหว่างโครงข่ายภายนอกประเทศ";
"Incoming, Not On SIM" = "สายเข้า, ไม่อยู่บนซิม";
"All Services" = "บริการทั้งหมด";
"All Outgoing Services" = "บริการสายออกทั้งหมด";
"All Incoming Services" = "บริการสายเข้าทั้งหมด";

"Disabled" = "ปิดใช้";
"Enabled" = "เปิดใช้";

"On All Calls" = "สายทั้งหมด";
"When Busy" = "กรณีสายไม่ว่าง";
"When Unanswered" = "กรณีไม่มีการตอบรับ";
"When Unreachable" = "กรณีติดต่อไม่ได้";

"Setting %@ Succeeded" = "%@ค่าติดตั้งสำเร็จ\n";
"Setting Interrogation Succeeded" = "การซักถามค่าติดตั้งสำเร็จ\n";
"Setting %@ Failed" = "%@ค่าติดตั้งไม่สำเร็จ\n";
"Setting Interrogation Failed" = "การซักถามค่าติดตั้งไม่สำเร็จ\n";

"Not Available" = "ไม่พร้อม";
"Network Controlled" = "เครือข่ายถูกควบคุม";
"Temporarily Disabled" = "ปิดใช้งานชั่วคราว";
"Temporarily Enabled" = "เปิดใช้งานชั่วคราว";
"Unknown" = "ไม่ทราบ";

"Activation" = "เปิดใช้";
"Deactivation" = "ปิดใช้";
"Interrogation" = "ซักถาม";
"Registration" = "ลงทะเบียน";
"Erasure" = "ลบ";

"No Address" = "ไม่มีที่อยู่";
"No Service Specified" = "ไม่มีบริการที่กำหนด";
"Type %d" = "ประเภท %d";

// generic error
"CALL_FAILED" = "สายไม่ติด";
// error codes
"kCTNoError" = "ไม่มีข้อผิดพลาด";
"kCTUnknownError" = "ข้อผิดพลาดที่ไม่ได้กำหนด";
"kCTErrorRadioFailure" = "สัญญาณวิทยุล้มเหลว";
// Generic network errors
"kCTErrorNetworkFailure" = "เครือข่ายล้มเหลว";
"kCTErrorCongestion" = "เครือข่ายหนาแน่น";
"kCTErrorUnidentifiedSubscriber" = "ไม่รู้จักผู้สมัครใช้บริการ";
"kCTErrorFacilityRejected" = "สถานที่บริการถูกปฏิเสธ";
"kCTErrorUnknownSubscriber" = "ไม่ทราบชื่อผู้สมัคร";
"kCTErrorNetworkOutOfOrder" = "เครือข่ายไม่ทำงาน";
"kCTErrorInvalidTransactionIdentifier" = "หมายเลขชุดคำสั่งไม่ถูกต้อง";
"kCTErrorSemanticallyIncorrectMessage" = "ข้อความไม่ถูกตามแบบข้อกำหนด";
"kCTErrorInvalidMandatoryInformation" = "ข้อมูลบังคับไม่ถูกต้อง";
"kCTErrorMessageTypeNonExistant" = "ไม่พบประเภทข้อมูล";
"kCTErrorMessageNotCompatibleWithProtocolState" = "ข้อความเข้ากันไม่ได้กับสถานะของโปรโตคอล";
"kCTErrorInformationElementNonExistant" = "ไม่พบข้อมูล";
"kCTErrorProtocolErrorUnspecified" = "ข้อผิดพลาดโปรโตคอลที่ไม่กำหนด";
"kCTErrorTemporaryFailure" = "ไม่ทำงานชั่วคราว";
"kCTErrorResourcesUnavailable" = "รีซอร์ซไม่พร้อมใช้";
"kCTErrorRequestedFacilityNotSubscribed" = "สถานที่บริการที่ขอยังไม่ได้สมัคร";
"kCTErrorRequestedFacilityNotImplemented" = "สถานที่บริการที่ขอยังไม่มีการจัดทำขึ้น";
"kCTErrorInterworkingError" = "ข้อผิดพลาดระหว่างเครือข่าย";
"kCTErrorInterworkingNotSupported" = "ไม่รองรับระหว่างเครือข่าย";
"kCTErrorCommandCannotBeActioned" = "ไม่สามารถใช้คำสั่งเป็นการทำงาน";
"kCTErrorNoNetworkService" = "ไม่มีบริการเครือข่าย";
// Call related errors
"kCTErrorUnassignedNumber" = "หมายเลขยังไม่ถูกใช้";
"kCTErrorOperatorDeterminedBarring" = "กันผู้ให้บริการโทรศัพท์ที่กำหนด";
"kCTErrorCallBarred" = "สายถูกกัน";
"kCTErrorUserBusy" = "สายไม่ว่าง";
"kCTErrorNoUserResponding" = "สายไม่ตอบกลับ";
"kCTErrorNumberChanged" = "หมายเลขเปลี่ยน";
"kCTErrorInvalidNumberFormat" = "รูปแบบหมายเลขไม่ถูก";
"kCTErrorCallRejected" = "สายถูกปฏิเสธ";
// SIM errors
"kCTErrorSimNotInserted" = "ไม่ได้ใส่ซิม";
"kCTErrorSimPinRequired" = "ต้องมีรหัส PIN ของซิม";
"kCTErrorSimPukRequired" = "ต้องใส่ PUK ของซิม";
"kCTErrorSimFailure" = "ซิมไม่ทำงาน";
"kCTErrorSimMemoryFailure" = "หน่วยความจำซิมล้มเหลว";
"kCTBadPinFormatError" = "รูปแบบ PIN เสีย";
"kCTErrorNumberNotAllowed" = "ไม่อนุญาตหมายเลข";
"kCTErrorIncorrectPassword" = "รหัสผ่านไม่ถูกต้อง";
// SMS Errors
"kCTErrorShortMessageTransferRejected" = "การส่งข้อความสั้นถูกปฏิเสธ";
"kCTErrorDestinationOutOfOrder" = "จุดปลายทายไม่ทำงาน";
"kCTErrorClass0NotSupported" = "ไม่รองรับ Class 0";
"kCTErrorCannotReplaceSm" = "ไม่สามารถเปลี่ยนซิม";
"kCTErrorUnspecifiedPid" = "PID ที่ไม่กำหนด";
"kCTErrorDataCodingSchemeNotSupported" = "ไม่รองรับวิธีเข้ารหัสข้อมูล";
"kCTErrorUnspecifiedDcs" = "ข้อผิดพลาดของ DCS ที่ไม่กำหนด";
"kCTErrorCommandUnsupported" = "ไม่รองรับคำสั่ง";
"kCTErrorUnspecifiedTpCommand" = "ข้อผิดพลาดคำสั่ง TP ที่ไม่กำหนด";
"kCTErrorTpduNotSupported" = "ไม่รองรับ TPDU";
"kCTErrorScBusy" = "SC ไม่ว่าง";
"kCTErrorRejectedBySimSmsControl" = "ถูกปฏิเสธโดยการควบคุม SMS ของ SIM";
// GPRS Errors
"kCTErrorGprsIllegalMs" = "MS ของ GPRS ไม่ถูกต้อง";
"kCTErrorGprsIllegalMe" = "ME ของ GPRS ไม่ถูกต้อง";
"kCTErrorGprsServicesNotAllowed" = "ไม่อนุญาตบริการ GPRS";
"kCTErrorGprsPlmnNotAllowed" = "ไม่อนุญาต PLMN ของ GPRS";
"kCTErrorGprsLocationAreaNotAllowed" = "ไม่อนุญาตบริเวณพิ้นที่ของ GPRS";
"kCTErrorGprsRoamingNotAllowedInLocationArea" = "ไม่อนุญาตให้ร่วมข้อมูลกับโครงข่าย GPRS ในบริเวณพื้นที่นี้";
"kCTErrorGprsServiceOptionNotSupported" = "ไม่รองรับตัวเลือกในบริการ GPRS";
"kCTErrorGprsServiceOptionNotSubscribed" = "ตัวเลือกในบริการ GPRS ไม่ได้สมัครเข้าใช้งาน";
"kCTErrorGprsServiceOptionTemporarilyOutOfOrder" = "ตัวเลือกในบริการ GPRS ไม่พร้อมใช้ชั่วคราว";
"kCTErrorGprsPdpAuthenticationFailure" = "การพิสูจน์ยืนยัน PDP ของ GPRS ล้มเหลว";
"kCTErrorGprsInvalidMobileClass" = "Mobile Class ของ GPRS ไม่ถูกต้อง";
"kCTErrorGprsUnspecified" = "ไม่ได้ระบุ GPRS";
"kCTErrorGprsMissingorUnknownAPN" = "ขาด GPRS หรือไม่ก็ APN ที่ไม่ทราบ";
"kCTErrorGprsPDPAuthenticationInfoRejectedByBaseband" = "ข้อมูลการพิสูจน์ยืนยัน PDP ของ GPRS ถูกปฏิเสธโดยเบสแบนด์";
